[
  {
    "body": "Hey mejammr! Unfortunately, your post has been removed because it does not contain enough text in the text area. Please feel free to re-submit with further elaboration in the text area, or message the moderators if you feel your post was removed unjustly. Thank you! [Include context - Create a well rounded post.](https://www.reddit.com/r/CasualConversation/wiki/encourage)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CasualConversation) if you have any questions or concerns.*",
    "created_utc": 1600429631
  },
  {
    "body": "I work on a Leblonde lathe that made tank barrels in WW2.",
    "created_utc": 1600429601
  },
  {
    "body": "Well it seems like you did the right thing. Hope you find a better job. Maybe try applying for an agency if u have ur own transport?",
    "created_utc": 1600429592
  },
  {
    "body": "Anything I cook. For some reason, I always think that any meal I make will turn out to be a disaster, maybe it's because of my lack of experience in the kitchen, but so far everything I've cooked turned out to be good. I am still waiting for the day where I give myself food poisoning.",
    "created_utc": 1600429590
  },
  {
    "body": "Octopus. At a Chinese wedding. It was delish.",
    "created_utc": 1600429512
  },
  {
    "body": "Hey ministry_miniclean! Unfortunately, your post has been removed because it does not contain enough text in the text area. Please feel free to re-submit with further elaboration in the text area, or message the moderators if you feel your post was removed unjustly. Thank you! [Include context - Create a well rounded post.](https://www.reddit.com/r/CasualConversation/wiki/encourage)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CasualConversation) if you have any questions or concerns.*",
    "created_utc": 1600429484
  },
  {
    "body": "No union and I quit that job. Bosses gave me surprised pikachu face when I put my 2 weeks.\n\nKnew people there who quit during lunch and never came back.",
    "created_utc": 1600429479
  },
  {
    "body": "If you want to stay up, do it? Words are just words, your life is your to choose what to do with.",
    "created_utc": 1600429445
  },
  {
    "body": "Maybe someday we'll get the hang of those grinder machines lol",
    "created_utc": 1600429402
  },
  {
    "body": "Honestly not a fan. The 3 axis had to get 2 bearings X&amp;Z replaced already and the y slide bearing is making a ton of noise now.  Damn thing alarms for breathing on it too. \n\nI also run a smooth control 4 axis Mazak but it has the same problem with controls. But build quality is slightly better.\n\nMazatrol controls are infuriating. Data assigns, eia monitoring... all those things are done so much easier on Fanuc controls for mori-seki or matsuuras machines. I really miss those machines.",
    "created_utc": 1600429373
  },
  {
    "body": "Anchovies. They just dumb salty. If you counteract the salt effectively they are 👌👌",
    "created_utc": 1600429179
  },
  {
    "body": "I believe some nurses at night shifts have the same mentality that they will never get even a chance to date someone. It might be possible if you aim for the right demographic. \n\nGo get some you nocturnal animal!",
    "created_utc": 1600429025
  },
  {
    "body": "On the nicer side, at least they want you to get into something with them. I think they are just excited about it and want you to join in. It can get tedious but if no one asked you to watch anything that's worse.",
    "created_utc": 1600428902
  },
  {
    "body": "Swag girl, swag.\n\nRemember us when you get a video of a lathe tearing something to pieces. Reddit loves stories about how dangerous lathes are.",
    "created_utc": 1600428742
  },
  {
    "body": "Pasta with vodka cream sauce it's really a 80s Italian thing, like strawberries risotto lol however they're not typical italian dishes, we usually don't eat them and there isn't a standard recipe",
    "created_utc": 1600428677
  },
  {
    "body": "hello",
    "created_utc": 1600428639
  },
  {
    "body": "haha, you aren't the only one messing up his sentences. I've also been struggling to make and say decent sentences in English. When I first noticed that I thought maybe that was because English isn't my mother tongue, but then I realized that I was stumbling and stuttering in my own language. So I figured out there were a few reasons for that, first is a lack of reading. Basically when I read any book I tend to think clearer and form sentences much easier. Second reason is a state of mind. I mean when I was anxious, nervous, sleepy or any other destructive state or all of the above combined - I could barely form simple sentences. But whenever I felt good mentally I was able to clearly express my thoughts without even spending a split-second to think about what I was about to say. \n\nThese days I feel like I've overcame this problem since I quit smoking and drinking. I got my healthy sleeping mode back on and all of these factors combined make my mind work really well and I don't struggle expressing myself as much as I did.",
    "created_utc": 1600428429
  },
  {
    "body": "Like religion or music, people love confirmation of the validity of their own choices. they want you to like it to prove they are right in liking it. Few people are willing to say \"I like some different stuff that you might not like\" and be okay with that.",
    "created_utc": 1600428426
  },
  {
    "body": "Cool, what's the latest movie you've watched then? Lol",
    "created_utc": 1600428347
  },
  {
    "body": "Hadn't even noticed that you suggested a Tokimonsta track till now. She's another favourite. We need to sit around, drink beer and listen to tunes together, some day.",
    "created_utc": 1600428224
  },
  {
    "body": "The Hobbit + Lord of the rings (4 books), if you haven't read them. They are my favourite in fantasy, with really good writing, and not focused on teenagers. \n\nAfter that is To Kill a Mockingbird, though I guess that isn't fantasy.",
    "created_utc": 1600428209
  },
  {
    "body": "Great job OP!  Keep it up!!",
    "created_utc": 1600428198
  },
  {
    "body": "Thank you for your response. I actually only rent a room in a house, not a full place. Thank you for showing me those subs mate :)",
    "created_utc": 1600428123
  },
  {
    "body": "I know my answer isn't the most reassuring one. But it's going to be very hard to find a job that you are qualified for. Like you said, your aim should be get ANY job that will get you through the pandemic. \n\nGo to subs like r/frugal, r/personalfinance and look for ways to do the best with what little you have. \n\nCan you get roommates in the meantime so that you may save up on rent?",
    "created_utc": 1600428057
  },
  {
    "body": "Sorry, I haven't gotten home yet, so I can't send you any pics of Charlie (that's his name), but [here](https://www.zoomiguana.com/wp-content/uploads/2019/08/IMG_1186-1-1200x1014.jpg)'s a image I found on google that is pretty close",
    "created_utc": 1600427929
  },
  {
    "body": "Life is ok! I'm enjoying a lot of the changes covid has brought to my work place. I'm an office guy though so I imagine it is much more difficult for you.\n\nI played piano for years growing up and I've actually been meaning to. Get back into it.",
    "created_utc": 1600427867
  },
  {
    "body": "Actually that happens with me and my friends... I've watched a lot of movies and shows. But not ALL of them (obviously) and when my friends start talking about shows or movies and I say I never watched them, they (pretend) FREAKOUT..... In turn... I do the same when the tables turn! Ahahah",
    "created_utc": 1600427836
  },
  {
    "body": "Hey there, u/KantenKant this submission has been removed because: \n\n&amp;nbsp;\n\n**This submission is a prohibited post.** \n \n[Some topics are better suited elsewhere with more care, please view our wiki for better suited subs and our reasoning behind them.](https://www.reddit.com/r/CasualConversation/wiki/prohibited)\n\n-  **Beliefs**: Discussion on controversial topics (i.e. religion, gender, politics) and loaded questions or statements.  — try r/SeriousConversation, r/changemyview, r/politicaldiscussion, or r/AskReddit\n\n\n\n---\n*If you have any questions, we ask that you  [**message the moderators**](https://www.reddit.com/message/compose?to=/r/CasualConversation&amp;subject=My submission was removed&amp;message=I have a question regarding the removal of this [submission]%28https://www.reddit.com/r/CasualConversation/comments/iv3no5/-/%29.) directly for appeals. Let's try to come to an agreement.*\n\n[Rules](https://www.reddit.com/r/CasualConversation/wiki/rules) | [Etiquette](https://www.reddit.com/r/CasualConversation/w/etiquette/) | [Prohibited Posts](https://www.reddit.com/r/CasualConversation/wiki/prohibited) | [Subreddit Directory](https://www.reddit.com/r/CasualConversation/wiki/directory) | [Support](https://www.reddit.com/r/CasualConversation/wiki/support) | [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2FCasualConversation)",
    "created_utc": 1600427833
  },
  {
    "body": "that’s awesome!",
    "created_utc": 1600427596
  },
  {
    "body": "Some buchettt if you make money is ok but kid needs all thing end money I make I gibe to you",
    "created_utc": 1600427561
  },
  {
    "body": "I used to build and calibrate Mazaks from 2008 to 2012 as an appentice, what is your honest opinion of them?",
    "created_utc": 1600427410
  },
  {
    "body": "This kind of encouragement is amazing. My clinic does this too but I’m smaller ways, each blood draw the vet would say “sou wanna try for blood and do nails?” And I’m like hell yeah mama! And every time anyone does anything we go “nice one!” Or “you totally got it that was a tough one” or when shit hits the fan and phones are ringing and there are patients to discharge we are just all encouraged and praised each small thing it’s amazing and makes work really fun to go back to",
    "created_utc": 1600427390
  },
  {
    "body": "Thank you for your cogent response. The logic of this answer actually made lots of sense to me. I’m on jobseekers Benefit but it doesn’t even cover rent, so I’m in need of a job. I think for the short term I need to try to save for a bike to become a delivery guy, which might be able to tide me over for a month or so.",
    "created_utc": 1600427304
  },
  {
    "body": "Ok but now you have to send a picture of your dog! Or at least tell me is name and describe him\n\nBenjals is so annoying. He is adorable with orange ears and an orange striped tail but all white with blues eyes. He talks/meows all the fucking time but he loves to be held. Hold on let me find you a baby [pic](https://i.imgur.com/dEEtAkH.jpg)",
    "created_utc": 1600427270
  },
  {
    "body": "That’s so kind, I’ll hit you a DM!",
    "created_utc": 1600427209
  },
  {
    "body": "I am really sorry that you are going through that. It's not that you aren't qualified, it's this pandemic is screwing everyone. \n\nLet's say guy with a PhD got fired because of the pandemic. He would rather have a job that looks/pays for someone with a Bachelor's degree. Some money is better than no money. \n\nIn the meantime, you aren't getting the job because the company thinks: why pay for someone with bachelor's degree when I can get a desperate guy with PhD for the same salary. \n\nExcept for the ultra rich, everyone who are working has either taken a serious pay cut or they are being overworked because everyone are desperate to keep their jobs.\n\nI know this logical answer isn't going to give you any comfort. I am sorry you and your dog are in this position. \n\nIs there any welfare in your country that you can apply for in the meantime?",
    "created_utc": 1600427134
  },
  {
    "body": "Got good friends coming to visit, woohoo!",
    "created_utc": 1600427131
  },
  {
    "body": "Thank you :)",
    "created_utc": 1600427083
  },
  {
    "body": "USA resident here.\n\nI honestly don't know how to talk about my country currently. I've been sick to my stomach for the last four years and I'm not hopeful about this November.\n\nIdk. I feel a decent amount of Americans are aware of our place on your word map but we don't know what to do and we are also scared of what's coming in the world. .  :/",
    "created_utc": 1600427038
  },
  {
    "body": "That’s a good one!",
    "created_utc": 1600427013
  },
  {
    "body": "I do a good bit of hiring if you'd like me to review your resume for you? I'm sure it's solid, but I know the struggle and maybe we can find the weak point together.",
    "created_utc": 1600426970
  },
  {
    "body": "Yes they are big fans!",
    "created_utc": 1600426955
  },
  {
    "body": "None hehe, I just watch movies - usually the recommendations on Netflix!",
    "created_utc": 1600426885
  },
  {
    "body": "That is definitely the main factor in this",
    "created_utc": 1600426834
  },
  {
    "body": "Now I'm curious. What shows are you into? Totally agree with you btw",
    "created_utc": 1600426818
  },
  {
    "body": "Since unemployment rates jumped to 10 percent as a result of Covid.",
    "created_utc": 1600426807
  },
  {
    "body": "The 3 hour commute was there and back, but that is the blessing of covid! My boss has seen that we are able to work from home so instead of getting up at 5am to commute to a 730 shift, I roll out of bed at 715 lol\n\nIdk, overall it's just american bullshit. This jobs pays the best I can find, with benefits, and it covers my housing in my expensive ass area to live. But I do live in a hous with all my best friends instead of weirdos so there's that",
    "created_utc": 1600426748
  },
  {
    "body": "Congratulations! It's so wonderful when great work is recognized and rewarded 👏👏👏",
    "created_utc": 1600426723
  },
  {
    "body": "1. Hi!\n2. I'm fine, thanks!\n3. Probably lasagna.\n4. Yes, I have a little dog (he's 8 months U ´ᴥ` U)\n5. Wow, Benjals looks really cute! I've actually never seen a cat like him before...",
    "created_utc": 1600426676
  },
  {
    "body": "Because other people always know better what you like or want /s\n\nEither they are a big fan of the tv show and therefore would like you to watch it so you both can talk about it or they are just being ignorant to the fact that not everyone shares the same interests.",
    "created_utc": 1600426674
  },
  {
    "body": "[deleted]",
    "created_utc": 1600426642
  },
  {
    "body": "What I tend to say is “I’ll add it to my list!” And then never watch it.",
    "created_utc": 1600426550
  },
  {
    "body": "Yeah I know, I've been waiting until I can order a second pair to use while the first is with nintendo. The whole quarantine switch shortage affected the joycons too. I honestly just play with the drift and bitch to my housemates lol",
    "created_utc": 1600426453
  },
  {
    "body": "Appreciate it. I am doing the 401k at work don’t really know the specifics though. My parents don’t have a financial adviser, but I’ll consider it in the future. \n\n\nBut 3 hour commute 😀 what the fuck. Haha, I use to complain about driving 1 hour to work.. I switched jobs to one that’s only 15-20 min away and I would never go back.. unless ofc they paid well. But I would definitely move closer, if I was able to. Why don’t you? I hope it does work out though! 🤞🏼",
    "created_utc": 1600426390
  },
  {
    "body": "I just cancelled my future membership of the student association. I figured out that my study association felt so comfortable that i didn't want to give that up for a student association.\n\nSo that felt really great.\n\n2 days ago was the first time i got so fucking drunk that i had to puke. That was less great.\n\nUhm yeah, going to campus in half an hour to study with a friend.\n\nAlso fun but sad fact: every sustainable development lecture starts with a few opinion based questions. The most frequent answers grow the biggest in a wordmap. This time the question was \"what countries are underdeveloped?\" It was pretty funny to see that the USA was in the top 5 just after congo and kenya. Probably because of the bad politics and poor equality tho. (Politics and equality are two of the five key elements of sustainable development).",
    "created_utc": 1600426383
  },
  {
    "body": "Yeah sure, of course! So ESL stands for English as Second Language. My daily routine basically consists of teaching English to kids and adolescents. I've been teaching for 4 years now so I don't spend time on preparing for my classes since I already know my ABCs :D\n\nWhat do I do apart from teaching? Hmmmm...I play computer games, play piano from time to time but these days I tend to spend more time outside walking in the park and reading a book. Life's good tbh :)\n\n&amp;#x200B;\n\nHow's life been so far for you, mate?",
    "created_utc": 1600426382
  },
  {
    "body": "We work 5am to 3pm on Mon-thur and 5am to 11am on Fridays.  It's like having long weekends every week.  I'm a prototype machinist/owner and I've done my fair share of 70 hour weeks.  We just are really efficient and crank the work out.",
    "created_utc": 1600426274
  },
  {
    "body": "It is free, long as you have something to send them in, you can get it done easy enough.  It will take a week or so, which would probably not be ideal when 3D allstars has just released.",
    "created_utc": 1600426264
  },
  {
    "body": "I'm 31 and my friends mentioned school probably started for their kids but ¯\\\\\\_(ツ)_/¯",
    "created_utc": 1600426239
  },
  {
    "body": "Hello! How are you doing? What is your favorite dish? Do you have a pet? Here is my cat [Benjals](https://i.imgur.com/wo1d6lb.jpg)",
    "created_utc": 1600426123
  },
  {
    "body": "Move to the country side and be a hermit",
    "created_utc": 1600426073
  },
  {
    "body": "[removed]",
    "created_utc": 1600426034
  },
  {
    "body": "Sweet. I've been a machinist for 27 years.  Its a tough industry but fun to make stuff.  I'm part owner of a company with 9 HAAS machines.  One mill turn lathe and 3 5 axis machine with the rest being just the standard vertical.  Keep grinding and you'll do great.  Pun intended.  Lol",
    "created_utc": 1600425920
  },
  {
    "body": "Always good to keep the options open.",
    "created_utc": 1600425913
  },
  {
    "body": "It's all fine for the moment, but we started only this week XD\nDid school started last Monday too in US?",
    "created_utc": 1600425879
  },
  {
    "body": "Sup friend? What is something important to you happening right now? Doesn't have to be politics, family/personal stuff is cool too",
    "created_utc": 1600425857
  },
  {
    "body": "Meh, everyone does it. People have different priorities and depending on the content of the conversation might require more time to reply/ think of a proper reply. Or they could just be subtly avoid you. Delayed replies are still better than being ghosted. But I’d rather be ghosted than get a “lol” as a reply a couple days later though. Alsp tirn off read receipts. It helps",
    "created_utc": 1600425796
  },
  {
    "body": "So the other day I made salmon in a vodka cream sauce. Idk how Italian that is but is there a recipe you would say is ITALIAN? I'd love to get some feedback and cook some cool shit",
    "created_utc": 1600425760
  },
  {
    "body": "It's 12:40 in Italy, today I finished school earlier than usual and I'll have a lunch shortly. Good night! (or good morning, depending on your point of view)",
    "created_utc": 1600425665
  },
  {
    "body": "Am following a lecture here in the netherlands on the topic of global sustainable development.\n\nBut the guess lecturer talks soooo slow",
    "created_utc": 1600425656
  },
  {
    "body": "Lol how did it go?",
    "created_utc": 1600425613
  },
  {
    "body": "I'm in Italy too! I left school a few minutes ago...",
    "created_utc": 1600425521
  },
  {
    "body": "The first two episodes were directed by Ridley Scott! Who is the director of my favorite movie Gladiator so I am a little biased but I think it's real good\n\nThe first two episodes were on YouTube last I checked",
    "created_utc": 1600425513
  },
  {
    "body": "While the bosses are away! I like when workplaces aren't so stringent on silly rules as long as the job gets done.",
    "created_utc": 1600425510
  },
  {
    "body": "Good question, I think I usually get Emmental or other sliced cheese but there is this one cheese that I know only by its brand name and I don't know how they call it outside my country mm but it's a teeny bit better than any other cheese I've had so far",
    "created_utc": 1600425444
  },
  {
    "body": "No real plans. I'll probably clean my room and do laundry. We have a nice park with some trails by a lake that is still open so I'll probably do a little hike. Also I'll probably nap a lot lol",
    "created_utc": 1600425391
  },
  {
    "body": "Yep buddy feel free to dm me when online",
    "created_utc": 1600425384
  },
  {
    "body": "I can related,\nExercise they said, it’ll help you sleep they said,\nInsomnia intensifies.",
    "created_utc": 1600425359
  },
  {
    "body": "I'll give raised by wolves a whirl",
    "created_utc": 1600425342
  },
  {
    "body": "You sound like a wonderful teacher! I'm almost tearing up just listening to you describe this little girl. I don't know a lot about esl, would you be willing to talk a little bit more about what you do on the day to day?",
    "created_utc": 1600425316
  },
  {
    "body": "Beer breakfast with night shift co-workers is the shit.  It might be 8 AM to the rest of the world; but, y'all just finished your shift and a cold one hits just as good as it does for the 5 PM crowd.",
    "created_utc": 1600425249
  },
  {
    "body": "Congrats on the accolades! It's nice when your efforts are recognized by others. It's especially nice when those others reach out to let you know that they appreciate your work. Keep it up. I hope when bonus time comes around it is rewarding for you.",
    "created_utc": 1600425169
  },
  {
    "body": "I can hold witty and fluid but imaginary conversations in my head for hours in three friggin languages. Yet when it comes to actually talking out loud, I forget words from even my native language, mix up grammar and sometime end up making a joke out of the sentence I intended to speak. To make matters worse, I am a fast talker. My brain doesn’t really give my tongue to form all the words properly resulting in a weird half eaten sentence. \nI taught a course in college recently and it helped a lot. Students force you to slow down and come up with best possible way to phrase a concept. It takes effort but it rewires your brain to come up with new sentence structure. So, to anyone going through the same struggles, I would suggest a semester or two of teaching for a fix that pays (literally).",
    "created_utc": 1600425160
  },
  {
    "body": "420 here in Kazakhstan. I'm sitting at work, waiting for my students to finish the task I gave them while browsing through Reddit posts. I work as an ESL teacher and I'm having a group of little kids aged 7-9. There is a little girl in this group, God she is so sweeeeeeeet! I wish I had a daughter like her, I just can't help but admire her being so cute. I love all the children, but some of them are just like angels.",
    "created_utc": 1600425136
  },
  {
    "body": "Hey there, u/Memer_YaBoi this submission has been removed because: \n\n&amp;nbsp;\n\n**This submission is a prohibited post.** \n \n[Some topics are better suited elsewhere with more care, please view our wiki for better suited subs and our reasoning behind them.](https://www.reddit.com/r/CasualConversation/wiki/prohibited)\n\n-  **Obtainable Answer**: Questions with a specific obtainable answer.  — try using Google or your preferred search engine: Google, Bing, Duckduckgo, Reddit search, Reddit help: r/help, r/findareddit, r/bugs, r/modhelp, or r/ModSupport, or general help: r/NoStupidQuestions, r/tipofmytongue, r/helpmefind, r/whatisthisthing, r/techsupport, or r/OutoftheLoop\n\n\n\n---\n*If you have any questions, we ask that you  [**message the moderators**](https://www.reddit.com/message/compose?to=/r/CasualConversation&amp;subject=My submission was removed&amp;message=I have a question regarding the removal of this [submission]%28https://old.reddit.com/r/CasualConversation/comments/iuxqw6/-/%29.) directly for appeals. Let's try to come to an agreement.*\n\n[Rules](https://www.reddit.com/r/CasualConversation/wiki/rules) | [Etiquette](https://www.reddit.com/r/CasualConversation/w/etiquette/) | [Prohibited Posts](https://www.reddit.com/r/CasualConversation/wiki/prohibited) | [Subreddit Directory](https://www.reddit.com/r/CasualConversation/wiki/directory) | [Support](https://www.reddit.com/r/CasualConversation/wiki/support) | [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2FCasualConversation)",
    "created_utc": 1600425070
  },
  {
    "body": "My current shows, I've been watching My hero academia, shameless, and raised by Wolves.\n\nActually raised by Wolves has been more fantastic than it has any right to be",
    "created_utc": 1600425058
  },
  {
    "body": "Hey there, u/TriBrit_inTX this submission has been removed because: \n\n&amp;nbsp;\n\n**This submission is a prohibited post.** \n \n[Some topics are better suited elsewhere with more care, please view our wiki for better suited subs and our reasoning behind them.](https://www.reddit.com/r/CasualConversation/wiki/prohibited)\n\n-  **Beliefs**: Discussion on controversial topics (i.e. religion, gender, politics) and loaded questions or statements.  \n\n\n\n---\n*If you have any questions, we ask that you  [**message the moderators**](https://www.reddit.com/message/compose?to=/r/CasualConversation&amp;subject=My submission was removed&amp;message=I have a question regarding the removal of this [submission]%28https://old.reddit.com/r/CasualConversation/comments/iuxunk/-/%29.) directly for appeals. Let's try to come to an agreement.*\n\n[Rules](https://www.reddit.com/r/CasualConversation/wiki/rules) | [Etiquette](https://www.reddit.com/r/CasualConversation/w/etiquette/) | [Prohibited Posts](https://www.reddit.com/r/CasualConversation/wiki/prohibited) | [Subreddit Directory](https://www.reddit.com/r/CasualConversation/wiki/directory) | [Support](https://www.reddit.com/r/CasualConversation/wiki/support) | [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2FCasualConversation)",
    "created_utc": 1600425040
  },
  {
    "body": "Hey there, u/ilovekuro this submission has been removed because: \n\n&amp;nbsp;\n\n**This submission is a prohibited post.** \n \n[Some topics are better suited elsewhere with more care, please view our wiki for better suited subs and our reasoning behind them.](https://www.reddit.com/r/CasualConversation/wiki/prohibited)\n\n-  **Vent**: Venting without any avenue for discussion.  \n\n\n\n---\n*If you have any questions, we ask that you  [**message the moderators**](https://www.reddit.com/message/compose?to=/r/CasualConversation&amp;subject=My submission was removed&amp;message=I have a question regarding the removal of this [submission]%28https://old.reddit.com/r/CasualConversation/comments/iuy9hk/-/%29.) directly for appeals. Let's try to come to an agreement.*\n\n[Rules](https://www.reddit.com/r/CasualConversation/wiki/rules) | [Etiquette](https://www.reddit.com/r/CasualConversation/w/etiquette/) | [Prohibited Posts](https://www.reddit.com/r/CasualConversation/wiki/prohibited) | [Subreddit Directory](https://www.reddit.com/r/CasualConversation/wiki/directory) | [Support](https://www.reddit.com/r/CasualConversation/wiki/support) | [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2FCasualConversation)",
    "created_utc": 1600424926
  },
  {
    "body": "Yeah, the loneliness can really get you on weekends.\n\nAround 1 year ago I moved from my hometown for a new job, it's a great job, but it made me discover I'm really not good at making new friends.\n\nOn most weekdays it's fine, I have fun talking with my colleagues, sometime we even go out after work and grab a few beers.\n\nBut on weekends I feel absolutely alone, I'm friendly with my coworkers but they're not really my friends. Texting with my buddies and family from my hometown helps, but I miss the Sunday family lunches, the Friday night board games with my buddies, everything else, most of all I miss my cats and dogs, as they are in my mom's house.\n\nI know I'm kinda just ranting, but all of that was just to say you're not alone in feeling that way.",
    "created_utc": 1600424920
  },
  {
    "body": "Other easy thing you probably hear, but start saving for retirement as early as possible. Your parents might have a financial advisor and they should be willing to sit down to a free meeting with you (assuming you're early 20s) they can tell you the difference between an IRA and Roth IRA and give you a general investment strategy for the future",
    "created_utc": 1600424891
  },
  {
    "body": "Hey there, u/juanp2350 this submission has been removed because: \n\n&amp;nbsp;\n\n**This submission was abandoned by you.**  \n\n[It takes two to have a conversation so it's highly frowned upon to abandon your thread. When making a thread, keep the conversation going by commenting.](https://www.reddit.com/r/CasualConversation/wiki/encourage)\n\nEngage in your post\n  \n- We're here to talk, we don't want you to make a thread and completely ignore it.  \n- You are required to reply to any top-level comment within the first 3 hours.  \n- Don't make a thread if you are going to be away and not able to participate in the thread.  \n- If you are back and are willing to reinvigorate the post, please reply to as many comments as you like then message the mods.   \n\nBe sure to reply to some comments before you reach out, it'll give you a better chance to get it approved quicker.\n\n\n\n---\n*If you have any questions, we ask that you  [**message the moderators**](https://www.reddit.com/message/compose?to=/r/CasualConversation&amp;subject=My submission was removed&amp;message=I have a question regarding the removal of this [submission]%28https://old.reddit.com/r/CasualConversation/comments/iuyq8y/-/%29.) directly for appeals. Let's try to come to an agreement.*\n\n[Rules](https://www.reddit.com/r/CasualConversation/wiki/rules) | [Etiquette](https://www.reddit.com/r/CasualConversation/w/etiquette/) | [Prohibited Posts](https://www.reddit.com/r/CasualConversation/wiki/prohibited) | [Subreddit Directory](https://www.reddit.com/r/CasualConversation/wiki/directory) | [Support](https://www.reddit.com/r/CasualConversation/wiki/support) | [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2FCasualConversation)",
    "created_utc": 1600424884
  },
  {
    "body": "[deleted]",
    "created_utc": 1600424872
  },
  {
    "body": "actually, scratch that. I think it's Pride.",
    "created_utc": 1600424865
  },
  {
    "body": "That all sounds absolutely delicious! And now I think you know what to get for lunch 😁",
    "created_utc": 1600424835
  },
  {
    "body": "Exactly. I get burned out on genres after a while and have to switch it up and I always find new stuff to add to my collection and I love it",
    "created_utc": 1600424800
  },
  {
    "body": "Thank goodness 😂🙏",
    "created_utc": 1600424730
  },
  {
    "body": "Ego",
    "created_utc": 1600424716
  },
  {
    "body": "I would have gone up to a 10 because I always found 10 or around it to be really attractive, but I can't get it now due to work sadly. That sounds really cool I've not met anyone personally with that one but plenty of other nose and mouth piercings. I'm sure it looks cute especially with a button nose",
    "created_utc": 1600424713
  },
  {
    "body": "Hey there, u/McLuhven this submission has been removed because: \n\n&amp;nbsp;\n\n**This submission is a prohibited post.** \n \n[Some topics are better suited elsewhere with more care, please view our wiki for better suited subs and our reasoning behind them.](https://www.reddit.com/r/CasualConversation/wiki/prohibited)\n\n-  **Obtainable Answer**: Questions with a specific obtainable answer.  — try using Google or your preferred search engine: Google, Bing, Duckduckgo, Reddit search, Reddit help: r/help, r/findareddit, r/bugs, r/modhelp, or r/ModSupport, or general help: r/NoStupidQuestions, r/tipofmytongue, r/helpmefind, r/whatisthisthing, r/techsupport, or r/OutoftheLoop\n\n\n\n---\n*If you have any questions, we ask that you  [**message the moderators**](https://www.reddit.com/message/compose?to=/r/CasualConversation&amp;subject=My submission was removed&amp;message=I have a question regarding the removal of this [submission]%28https://old.reddit.com/r/CasualConversation/comments/iuzfkx/-/%29.) directly for appeals. Let's try to come to an agreement.*\n\n[Rules](https://www.reddit.com/r/CasualConversation/wiki/rules) | [Etiquette](https://www.reddit.com/r/CasualConversation/w/etiquette/) | [Prohibited Posts](https://www.reddit.com/r/CasualConversation/wiki/prohibited) | [Subreddit Directory](https://www.reddit.com/r/CasualConversation/wiki/directory) | [Support](https://www.reddit.com/r/CasualConversation/wiki/support) | [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2FCasualConversation)",
    "created_utc": 1600424703
  },
  {
    "body": "Hey there, u/otter_space08 this submission has been removed because: \n\n&amp;nbsp;\n\n**This submission was abandoned by you.**  \n\n[It takes two to have a conversation so it's highly frowned upon to abandon your thread. When making a thread, keep the conversation going by commenting.](https://www.reddit.com/r/CasualConversation/wiki/encourage)\n\nEngage in your post\n  \n- We're here to talk, we don't want you to make a thread and completely ignore it.  \n- You are required to reply to any top-level comment within the first 3 hours.  \n- Don't make a thread if you are going to be away and not able to participate in the thread.  \n- If you are back and are willing to reinvigorate the post, please reply to as many comments as you like then message the mods.   \n\nBe sure to reply to some comments before you reach out, it'll give you a better chance to get it approved quicker.\n\n\n\n---\n*If you have any questions, we ask that you  [**message the moderators**](https://www.reddit.com/message/compose?to=/r/CasualConversation&amp;subject=My submission was removed&amp;message=I have a question regarding the removal of this [submission]%28https://old.reddit.com/r/CasualConversation/comments/iuziwm/-/%29.) directly for appeals. Let's try to come to an agreement.*\n\n[Rules](https://www.reddit.com/r/CasualConversation/wiki/rules) | [Etiquette](https://www.reddit.com/r/CasualConversation/w/etiquette/) | [Prohibited Posts](https://www.reddit.com/r/CasualConversation/wiki/prohibited) | [Subreddit Directory](https://www.reddit.com/r/CasualConversation/wiki/directory) | [Support](https://www.reddit.com/r/CasualConversation/wiki/support) | [Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2FCasualConversation)",
    "created_utc": 1600424686
  }
]