[
  {
    "body": "also if your religious in any way, than you would go to hell for \"wasting life\"/an opportunity",
    "created_utc": 1600418339
  },
  {
    "body": "I understand how you feel. You feel the pressure to be the best in everything, the pride of the family but you have to take your life in your own hands. Study what you want to study. Don’t live your life for other people, live it for yourself. There is always another way to make it better for yourself.",
    "created_utc": 1600418289
  },
  {
    "body": "valid point, but you can end the suffering without suicide. suicide is also seen as morally wrong, because your choosing something that could be better or worse than the life you lived, and your betting your life it wont be endless suffering",
    "created_utc": 1600418250
  },
  {
    "body": "Stay positive, don't let others issues affect you outside of work",
    "created_utc": 1600417982
  },
  {
    "body": "Couldn't you say the same about suicide then? \n\nSelfish (from the suicidal person) for not sticking around and living a miserable life for those that care about them. Selfless (from the suicidal person) because they may think that other people would be better off without them.\n\nQuestion: Isn't it selfish of the person wanting the suicidal person to stick around and live miserably, in pain, suffering, etc. just so that they don't have to grieve their death?",
    "created_utc": 1600417859
  },
  {
    "body": "if your near suicide and others can't help you, do some self-therapy. you can do it while sober or on psychadelics, psychs are powerful and can help you answer questions you need answers to. but research thoroughly before doing them",
    "created_utc": 1600417643
  },
  {
    "body": "Well you should try to relax for now.\nActually thinking about it, reading ot googling it about it can make you feel even worse. It's called the Nocebo Effect.\n\nThe symptoms started exactly after this incident happened or you had them sometime before?",
    "created_utc": 1600417614
  },
  {
    "body": "[removed]",
    "created_utc": 1600417385
  },
  {
    "body": "I understand why you’d want to go. Are you religious at all?",
    "created_utc": 1600417304
  },
  {
    "body": "If this has been going for long you should talk to someone.\nYou should start with those who are close to you or you trust.",
    "created_utc": 1600416903
  },
  {
    "body": "u up?",
    "created_utc": 1600416829
  },
  {
    "body": "I have a gut feeling but don't want to wish anything upon my life by saying that I'm certain. The guy just seemed malicious afterwards and sketchy before we had sex, I then found out he was married which was something that I felt terrible about but it's obviously besides the point.",
    "created_utc": 1600416767
  },
  {
    "body": "[removed]",
    "created_utc": 1600416660
  },
  {
    "body": "[deleted]",
    "created_utc": 1600416648
  },
  {
    "body": "Just take a moment to breathe and clear your head",
    "created_utc": 1600416624
  },
  {
    "body": "Tbh, ur probably in a good place where you could vent. No need to hold back, whatever it is you know",
    "created_utc": 1600416616
  },
  {
    "body": "[deleted]",
    "created_utc": 1600416491
  },
  {
    "body": "no i havent told anyone about it",
    "created_utc": 1600416356
  },
  {
    "body": "[removed]",
    "created_utc": 1600416288
  },
  {
    "body": "Have you been diagnosed with a condition?",
    "created_utc": 1600416269
  },
  {
    "body": "[deleted]",
    "created_utc": 1600416197
  },
  {
    "body": "its usually just yelling.",
    "created_utc": 1600416182
  },
  {
    "body": "Are these thoughts the same everytime?",
    "created_utc": 1600416105
  },
  {
    "body": "If someone wants to die I dont think it would matter",
    "created_utc": 1600416066
  },
  {
    "body": "I didn't quite understand. There's nothing certain yet that you are positive? If so, ypu have to wait for any updates. I know it's not ideal but that's the only thing you can do right now.  \nIs there anything more to this? If it's ok to talk about it.\nSorry if I didn't understand what you meant.",
    "created_utc": 1600416037
  },
  {
    "body": "Got a family member who is born 20 April 1989. 100 years to the day of hitler birth. Thats a rough combo",
    "created_utc": 1600416014
  },
  {
    "body": "Trigger suckkkkkkkkkk. You’re doing great then bam \n\nI was so proud of myself too. I signed up for language school\n\nBought some new clothes\n\nI was getting happy. \n\nBullying sucks",
    "created_utc": 1600416006
  },
  {
    "body": "u wanna chat?",
    "created_utc": 1600415943
  },
  {
    "body": "the only way to really commit suicide is painful as fuck",
    "created_utc": 1600415918
  },
  {
    "body": "24/7",
    "created_utc": 1600415913
  },
  {
    "body": "[deleted]",
    "created_utc": 1600415887
  },
  {
    "body": "i'm doin pretty good except for a trigger i rarely get",
    "created_utc": 1600415748
  },
  {
    "body": "[removed]",
    "created_utc": 1600415730
  },
  {
    "body": "If you could go a little in detail. It would help me to jnderstand your Situation better",
    "created_utc": 1600415729
  },
  {
    "body": "anyone you have connections/bonds with, it will hurt them if you die. you don't know what happens after death,",
    "created_utc": 1600415667
  },
  {
    "body": "I hope you are doing well too. We are in the same group.",
    "created_utc": 1600415620
  },
  {
    "body": "Thank you \nLogically I understand this \n\nBut I hurt\n\nAnd I want to sleep forever.",
    "created_utc": 1600415579
  },
  {
    "body": "Do you have these thoughts 24/7? Is there something that triggers them or are they always lurking around?",
    "created_utc": 1600415554
  },
  {
    "body": "well those people can go fuck themselves, but when your about to do self harm, think of those people. they want you to get mad, they want to see you crumble, dont give them the satisfaction.",
    "created_utc": 1600415422
  },
  {
    "body": "Yes \nThe trigger came from an internet post about me.  Then people teased me for being suicidal, which caused more pain. She’s taking me there tonight. Luckily I don’t work this week so I don’t need to tell my boss as of now",
    "created_utc": 1600415152
  },
  {
    "body": "you should, you could have a worse trigger and die or become paralyzed or worse",
    "created_utc": 1600415033
  },
  {
    "body": "Many people live with their parents till they are 24 or 25 there is no shame in it.",
    "created_utc": 1600414981
  },
  {
    "body": "the thing is, you have someone who cares about you. i dont,, if i suicide, my body would be found months if not years after. i am this lonely i dont go outside anymore",
    "created_utc": 1600414822
  },
  {
    "body": "Thank you for talking about your thoughts. Your brain screaming at you sounds fucking intense. It's shitty that you're going through that right now.",
    "created_utc": 1600414816
  },
  {
    "body": "There is, looking at stats and hospitals suck",
    "created_utc": 1600414731
  },
  {
    "body": "Dude, Im about to fail out of a near ivy league school months before graduation. Same boat",
    "created_utc": 1600414637
  },
  {
    "body": "Talk to her",
    "created_utc": 1600414609
  },
  {
    "body": "?",
    "created_utc": 1600414579
  },
  {
    "body": "How though, there a really strong chance of failure",
    "created_utc": 1600414550
  },
  {
    "body": "I think death is painful because our bodies secretly want to be alive.  I’ve heard that our digestive systems actually have more neurons than a dogs brain.  Maybe our stomachs just want to live so they can keep wallowing in masticated food slop.  It’s interesting to think of why people want to live.  I mean, people list all kinds of reasons, but I wonder if anyone really knows.  Is it just the fear of absence of consciousness?  Anyway, we are all going to die eventually.  I’m sorry you are feeling this way, too.  I can relate.  Pain is a powerful motivator.  I wish I had a “sleep” button.  Dreams are best.  Don’t seem to be depressed and hopeless in dreams. They just happen. Life just happens. Death too.  I hope you can seek out a way to ride out this life with putting yourself into these painful events.  Your stomach still wants to eat. Your lungs still want to breath. Your ears still want to hear and your eyes still want to see.  Your mind wants to dream also.  Sometimes our thinking and feeling mind can’t connect with all the other egos within us.  It’s severely depressing and depersonalizing.  I end up in vegetative states because of it, but when I’m in those I can’t even organize a suicide.  I’m hostage to all my other selves.  Trying different drugs and routines to try to connect the dots.  It’s hard though.  I hope you can hang on and keep trying. When I see someone else get better it gives me hope for myself.",
    "created_utc": 1600414402
  },
  {
    "body": "Uh, write lets mfngo gamers as a suicide note youll stay alive forever",
    "created_utc": 1600414402
  },
  {
    "body": "I know that feeling of peace knowing that there's a way out. Who knows, maybe in 2 years you find a reason to keep living. And don't beat yourself up over college - your mental health is more important. Is there any way you can see a therapist if you want to?",
    "created_utc": 1600414059
  },
  {
    "body": ":)",
    "created_utc": 1600413887
  },
  {
    "body": "I have a very accelerating version of multiple sclerosis. It’s not just paralysis. Even though that would be enough because I can’t go anywhere. I’m losing my ability to speak. I’m not gonna be able to talk anymore. I’m alone trapped in this half dead body anyway. I just wanna go.",
    "created_utc": 1600413886
  },
  {
    "body": "Thank you!",
    "created_utc": 1600413801
  },
  {
    "body": "[removed]",
    "created_utc": 1600413506
  },
  {
    "body": "Happy cake day!",
    "created_utc": 1600413385
  },
  {
    "body": "[removed]",
    "created_utc": 1600413370
  },
  {
    "body": "Happy cake day!",
    "created_utc": 1600413358
  },
  {
    "body": "i help parents, friends, anyone i can, but when i need them people like my parents just ignores that goes on thier way.",
    "created_utc": 1600413352
  },
  {
    "body": "i know exactly how you feel.",
    "created_utc": 1600413286
  },
  {
    "body": "I don’t know what your situation is but I gave you a hug! Everything’s better with a hug :)",
    "created_utc": 1600413249
  },
  {
    "body": "I don't know if any of that advice help that all but I'm always happy to help and I'm always here if you need anymore\n\nI can't help but help that person\nTo have empathy\nTo be an empath\nI hope you would understand",
    "created_utc": 1600413239
  },
  {
    "body": "Sure!",
    "created_utc": 1600413178
  },
  {
    "body": "this community was created on my birthday holy shit that means nothing but okay.",
    "created_utc": 1600413166
  },
  {
    "body": "You looking to Snapchat maybe?",
    "created_utc": 1600412987
  },
  {
    "body": "[deleted]",
    "created_utc": 1600412980
  },
  {
    "body": "[removed]",
    "created_utc": 1600412771
  },
  {
    "body": "Exactly how it is. I don’t want to be that guy who rub all the things I did but at least help me out for the one time.",
    "created_utc": 1600412742
  },
  {
    "body": "I'm an 22-year-old Iranian girl and I absolutely know your pain brother. The pain is a burden we born with and must carry our whole life.\nI'm an agnostic but my strictly religious parents force me to wear Chador and do all the stuff Muslims should do, because what other ppl would say about them if I wouldn't do this stuff? The whole thing is about them, always them, never me.\n\nI'm an engineering student and I managed to get into a university that was far from the city my family lives in, so I would see them less often and could have more peace mentally, but because of this Covid-19 situation they forced us to flee our dorms and now I'm stuck in here with them again. We have an argument almost every day. We even had the same exact argument about cats.\n\nI hate it here. I see no future for myself. How the hell could I ever afford to live independently? How the hell could I ever afford to own my place, to not be under their influence? My whole life is dedicated to leaving Iran because I know I have no chance for living a normal life here, but I know that my family won't support me by any means. We are not that poor of a family, we are middle class and the money that I need for immigration (let's say 40k USD at most), is just about 1/4 of the value of a flat of the entire building my parents own. But I know for a fact they will never help me, because my dad says \"we should love our country and Islam, this is the best country in the world, USA is doomed to failure, we love our family and can't live without each other, etc\". But guess what? I hate every single one of those things.\n\nI really wish death may sooner put me out of my misery.",
    "created_utc": 1600412625
  },
  {
    "body": "Thanks, I know how you feel, when you help someone you help them gladly, but when you need help they not there for you, Right?",
    "created_utc": 1600412514
  },
  {
    "body": "u wanna chat?",
    "created_utc": 1600412432
  },
  {
    "body": "It’s extremely human to want attention.  We all need attention , almost everything is attention seeking in a way.  It just has a bad connotation because people like to feel superior however they can.  “Attention seeking” behavior usually just means someone doesn’t have their needs met.  So it makes sense that they’d seek attention",
    "created_utc": 1600412400
  },
  {
    "body": "theres lots of things wrong with suicide. first, your loved ones or the people youve made an impact on, big or small, will feel that pain of losing you. second, you lose the things worth living for, it can be something small, like ur pet or looking at the sky, but these things may be important to you, and third, humans have a survival instinct because you dont know what happens when your dead, and the fear of that keeps people going. im more scared of losing my consciousness and never knowing because you became nothing, maybe you did become something, but you or others dont know",
    "created_utc": 1600412337
  },
  {
    "body": "having a child is both selfish and selfless. it keeps the human race going",
    "created_utc": 1600411864
  },
  {
    "body": "[deleted]",
    "created_utc": 1600411712
  },
  {
    "body": "hey, you wanna chat?",
    "created_utc": 1600411611
  },
  {
    "body": "I know. I’m the same way.  Rewards are hard to come by.  I feel the same way a lot.  It wasn’t always so bad, and it probably won’t always be as bad as this.  If you live long enough, you go through lonely hard times and relatively good times.  You are in a hard stretch.  Your biggest rewards might not come until you are much older.  You gotta have those little rewards to see you through, though. \nYou probably think more about life than other people your age do, so you are naturally going to feel estranged.  Just go with that.  Be angry, be a nihilist and smoke cigarettes and make fun of the idiots.  Don’t kill yourself though. At your age you are guaranteed to be missing out on a lot of rewards if you leave now.  Shot doesn’t get good until 21 or older for most people.  18 if you are lucky.",
    "created_utc": 1600411439
  },
  {
    "body": "Maybe you should describe your situation in detail.",
    "created_utc": 1600411430
  },
  {
    "body": "You’re more than welcome",
    "created_utc": 1600411375
  },
  {
    "body": "I ken that, I was just being a pain in the ass\n\nActually I needed to see what kind of emotional response I'd get. The high emotionalism usually isn't a characteristic of sociopaths, as we tend to be more pragmatic and cold-blooded about things. So right there you may not be a sociopath.",
    "created_utc": 1600411370
  },
  {
    "body": "Why do you think you’ll be alone for the rest of your life?? Just because you’re in a wheelchair? I know so many people who are disabled and married or have a partner",
    "created_utc": 1600411341
  },
  {
    "body": "Friend, is it ok if i talk to you?",
    "created_utc": 1600411330
  },
  {
    "body": "No clue why I kept going. Guess I have some unfinished business to do before I do something stupid.",
    "created_utc": 1600411323
  },
  {
    "body": "Well this is annoying. I have always wondered why suicide is selfish but having a child isnt.",
    "created_utc": 1600411059
  },
  {
    "body": "[removed]",
    "created_utc": 1600410987
  },
  {
    "body": "Aye Brian the lion. You live that life. Learn, explore, discover and uncover the beauty. Sometimes you have to play by a few rules but I believe in you.",
    "created_utc": 1600410666
  },
  {
    "body": "[deleted]",
    "created_utc": 1600410495
  },
  {
    "body": "[removed]",
    "created_utc": 1600410487
  },
  {
    "body": "[removed]",
    "created_utc": 1600410447
  },
  {
    "body": "Thanks but there’s not much to say really. I’m chair bound. Can’t move my legs anymore. I’ll be alone for the rest of my life so I just want it to stop. I’m gonna kill myself next month.",
    "created_utc": 1600410425
  },
  {
    "body": "Nah. Come on man. You’re 15, right?  Life sucks at that age.  If it’s really as bad as you say it is, it has to get better.  You just gotta find something to get you through one day at a time.",
    "created_utc": 1600410406
  },
  {
    "body": "I get it. Life is exhausting.",
    "created_utc": 1600410398
  },
  {
    "body": "A failed attempt from my childhood,  and a promise to myself to carry my own weight until I do finally kick it.",
    "created_utc": 1600410372
  },
  {
    "body": "Please listen to u/krathman257 . seeing another sunrise can be enough reason to wake up tommorow.",
    "created_utc": 1600410250
  },
  {
    "body": "[removed]",
    "created_utc": 1600410206
  },
  {
    "body": "no",
    "created_utc": 1600410178
  },
  {
    "body": "Have you heard of Jack?",
    "created_utc": 1600410060
  },
  {
    "body": "What made the classroom unhappy for you? The main thing I haven't liked is how often in adult education that I've experienced instructors who basically read the textbook aloud without adding anything of their own. I felt more at home in Canada as far as climate and feeling secure. In the US, I've met some amazing people but things have been more financially rough.\n\nI do artwork, read (little tidbits of education, not much in the way of books), weightlift, skate, and watch sports.\nI prefer ice, but the lack of rinks here makes roller a default. I guess finding a league could be worth a shot.\n\nUrbex is fun and fascinating, just risky with trespassing.\n\nYep, I'm going for paramedic for sure. I kinda feel that with my degree. I only vaguely remember anything I did in those four years. Science degrees don't do much unless they're 4+ years. I hate research though. Did you ever find it beneficial?\n\nIn a way, I do. It's mainly the feeling of being protected. Not just in the be there for you way, but physically. Even though I'm on the smaller/athletic side and a bit geeky, I am attracted to my opposite. Usually heavier people that are outdoorsy. It's not like a fetish. I guess it came from being raised around guys like that. I've given different people a shot, but it hasn't been the greatest time because I feel like I hurt them for a shallow reason. Trust isn't something I'm the best with, but I'm trying to do better.\n\nI get urges to hurt myself again. It's just something that hits me out of nowhere, turn of a switch. Today I ran some errands and did some coursework.\nHow has your day been?\nAs an upside, I'm on medication and feeling a bit better.",
    "created_utc": 1600409977
  },
  {
    "body": "[deleted]",
    "created_utc": 1600409975
  }
]